//
// // - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// // кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// //     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// //
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// console.log(friends);
//
// if (friends.length >= 2) {
//     console.log('Massive is too big');
// } else {
//     console.log('Massive is too small')
// }
//
// // - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// //     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
//
// let number = [2, 1, 3];
// console.log(number.sort());
// console.log(number[1]);
//
//
// // - Перепишіть конструкцію if з використанням умовного оператора '?':
// // let result;
// // if (a + b < 4) {
// //     result = 'Мало';
// // } else {
// //     result = 'Багато';
// // }
//
//
// let a = +prompt('Enter first number');
// let b = +prompt('Enter second number');
//
// let result = a + b < 4 ? 'Мало' : 'Багато';
// console.log(result);
//
// // - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// // напишіть це тернарним оператором
//
// let v1 = +prompt('Enter number from -100 to 0:');
// let v2 = +prompt('Enter number 0:');
// let v3 = +prompt('Enter any number from 0 to 100: ');
//
// let number1 = v1 < 0 ? 'negative' : v2;
// console.log(number1);
//
//
// let number2 = v2 === 0 ? 'zero' : false;
// console.log(number2);
//
// let number3 = v3 > 0 ? 'positive' : false;
// console.log(number3);
//
// // - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// //     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// let test = confirm('Have you passed a test?');
//
//
// let result = test ? 'Правильно' : 'Неправильно';
// console.log(result);
//
// // - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// // Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
// let q = prompt('What is official name of JavaScript?');
//
// if (q === 'ECMAScript'){
//     alert('Right');
// }else {
//     alert("Don't know? ECMAScript!")
// }
//
// // /     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// // Користувач вводить номер квартири просто в змінні або через prompt('') .
// //     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
// //
//
// let n = +prompt('Where is an apartment?');
// if (n >= 1 && n <= 20) {
//     alert("it's first sub-unit");
// }else if (n >= 21 && n <= 48) {
//     alert("it's second sub-unit");
// } else if (n >= 49 && n <= 90) {
//     alert("it's third sub-unit");
// }else {
//     alert('There is no apartment with this number.')
// }
//
//
// // - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = +prompt('Give your number');
//
// if (number === 10) {
//     alert('Вірно');
// } else {
//     alert(`Невірно`);
// }
//
//
// // - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// //     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// //     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// //
//
// let q = +prompt('Яка сьогодні температура?');
//
// if (q >= 10 && q <= 22) {
//     alert('Йдемо вчитися в Okten.');
// }else {
//     alert('Сидимо вдома і вчимось онлайн.')
// }
//
//
// // - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// //     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ..
//
// let quiz = +prompt('Вікторина. Введіть число від 1 до 5');
//
// switch (quiz) {
//     case 1:
//         alert('Ви виграли авто.');
//         break;
//     case 2:
//         alert('Ви виграли телефон.');
//         break;
//     case 3:
//         alert('Ви виграли шоколадку.');
//         break;
//     case 4:
//         alert('Ви виграли мото.');
//         break;
//     case 5:
//         alert('Ви виграли велосипед.');
//         break;
//     default:
//         alert('Такого числа не існує.')
// }